[AdventPathfinderArmor X2ArmorTemplate]
FriendlyName="ADVENT Pathfinder Armor"
FriendlyNamePlural="ADVENT Pathfinder Armors"
BriefSummary="The ADVENT Pathfinder is a fast recon unit with thicker armor than the average trooper. They excel in pulling off aggressive flanking maneuvers."
TacticalText="<Bullet/> Soldiers may take advantage of scavenged ADVENT Pathfinder gear in combat. Additionally, we may catch our enemy off guard with this new armor."

[AdventPathfinderArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."

[AdventPathfinderArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Stalker"
LocLongDescription="The ADVENT Pathfinder's armor offers a small boost to health, armor, and mobility."
LocHelpText="The ADVENT Pathfinder's armor offers a small boost to health, armor, and mobility."
LocFlyOverText="The ADVENT Pathfinder's armor offers a small boost to health, armor, and mobility."
LocPromotionPopupText="<Bullet/> The ADVENT Pathfinder's armor offers a small boost to health, armor, and mobility."
